############################################################
# [10-1] list Method 이해
############################################################

# l = [1]
# print(l)
# 
# l.append(4)
# l.insert(1, 5)
# l.append((3, 'KIM'))
# l.extend((6, 'LEW'))
# print(l)
# 
# l.remove(1)
# print(l)
# 
# x = l.pop()
# y = l.pop(2)
# print(x, y)
# print(l)
# 
# l= [1,8,10,4,5]
# print(l)
# l.reverse()
# print(l)
# l.sort()
# print(l)
# l.sort(reverse = True)
# print(l)

############################################################
# [10-2] 전학생 자리 배치
############################################################
  
# a = [1,4,7,10]

# while True:
#     m = int(input())

#     # 코드 작성
#     for i in range(len(a)):
#         if m < a[i]:
#             a.insert(i,m)
#             break
#     else:
#         a.append(m)
        
#     print(a)

############################################################
# [10-11] set 연산자 및 메서드 동작 이해
############################################################

# t = (1, 3, 5, 5, 7, 9)
# l = [1, 3, 3, 8]
# print(set(t), len(set(t)))
# print(set(t) & set(l))
# print(set(t) | set(l))
# print(set(t) - set(l))
# print(set(t) ^ set(l))
# s = {1,2}
# s.add(-1)
# print(s)

############################################################
# [10-12] 빵을 두 군데서 받은 학생은 모두 몇 명?
############################################################

# x = ('kim', 'lee', 'park', 'song', 'moon', 'lew')
# y = ('min', 'park', 'kong', 'mo', 'lew')

# # 코드 작성
# num = len(set(x)&set(y))

# print( num )

############################################################
# [10-13] 없어진 학생은?
############################################################

K = int(input())

for x in range(K):
    N, M = (int(y) for y in input().split())
    r = [int(y) for y in input().split()]
    # 코드 작성
    n = list(range(1,N+1))
    i = list(set(n)-set(r))
    print(*i)
     
    

   
############################################################
# [10-15] 문자별 횟수 세기
############################################################

# n = '2378C946C736B8B30B38B478749ZZ928623234234'
# 
# c1 = {}
# 
# for x in set(n):
#     c1[x] = n.count(x)
# 
# c2 = dict(map(lambda x : (x, n.count(x)), set(n)))
# 
# c3 = {x : n.count(x) for x in set(n)}
# 
# print(c1, c2, c3, sep = '\n')
