############################################################
# [7-1-1] 사용자 함수
############################################################

# a = 10

# def f1() : print(1)
# def f2() : print(a + 1)
# def f3(x, y) : print(max(x, y))
# def f4(x, y) : return x + y

# f1()
# f2()
# f3(5, 10)
# print(f4(5, 10))

############################################################
# [7-1-2] Lambda 식으로 이름없는 함수 만들기
############################################################

# a = 10
# l1 = lambda : print(1)
# l2 = lambda : print(a+1)
# l3 = lambda x,y :print(max(x,y))
# l4 = lambda x,y : x+y

# l1()
# l2()
# l3(5, 10)
# print(l4(5, 10))

############################################################
# [7-2] Lambda 함수 동작 분석
############################################################

# def sqr(x) :
#     return x ** 2
# 
# y = map(sqr, [1,3,4,7])
# print(*y)
# 
# z = map(lambda x : x ** 2, [1,3,4,7])
# print(*z)

############################################################
# [7-3] tuple로 리턴되는 함수를 lambda 식으로 설계
############################################################

# def func(a, b) : return a+b, a-b, a*b, a/b
# 
# print( func(3,4) )
# 
# f1 = lambda a, b : (a+b, a-b, a*b, a/b)
# f2 = lambda a, b : [a+b, a-b, a*b, a/b]
# print( f1(3, 4) )
# print( f2(3, 4) )

############################################################
# [7-4-1] 다중 container의 대소 비교
############################################################

# t = (('banana', 500, 'yellow'), ('apple', 600, 'red'), ('kiwi', 500, 'brown'))
# 
# min_item = min(t)
# print('min =', min_item)

############################################################
# [7-4-2] min, max 함수의 비교 대상 지정
############################################################

# def func(x) :
#     print(x, x[1])
#     return x[1]
#     
# t = ((10, 'kim'),(21, 'choi'),(8, 'song'))
# 
# print('min #1 =', min(t))
# print('min #2 =', min(t, key = func))

############################################################
# [7-5] min, max 함수의 비교 대상 지정
############################################################

# def comp1(x) : return x[0]
# def comp2(x) : return x[1]
# def comp3(x) : return x[1], x[2]
#     
# t = (('banana', 500, 'yellow'), ('apple', 600, 'red'), ('kiwi', 500, 'brown'))
# 
# print( min(t, key = comp1), max(t, key = comp1) )
# print( min(t, key = comp2), max(t, key = comp2) )
# print( min(t, key = comp3), max(t, key = comp3) )

############################################################
# [7-6] key로 전달하는 함수를 lambda로 구현
############################################################

# #  def comp1(x) : return x[0]
# #  def comp2(x) : return x[1]
# #  def comp3(x) : return x[1], x[2]
    
# t = (('banana', 500, 'yellow'), ('apple', 600, 'red'), ('kiwi', 500, 'brown'))

# print( min(t, key = lambda x: x[0]                             ) ) # key = comp1 기능 
# print( min(t, key = lambda x: x[1]                             ) ) # key = comp2 기능
# print( min(t, key = lambda x: (x[1],x[2])                             ) ) # key = comp3 기능

############################################################
# [7-7] sorted 함수의 정렬 기준 전달
############################################################

# x = [('apple','red',500),('kiwi','brown',300),('banana','yellow',300)]

# y1 = sorted(x, key = lambda a : a[0], reverse = True)
# y2 = sorted(x, key = lambda a : a[1])
# y3 = sorted(x, key = lambda a : a[2])
# y4 = sorted(x, key = lambda a : (a[2], a[0]))

# print(x, y1, y2, y3, y4, sep = '\n')

############################################################
# [7-8] 입력된 모든 실수 값들을 정수화(round)후 제곱하기
############################################################
# x = input().split()
# # 함수는
# # 반복(
# #     플롯 ->라운드 ->제곱
# # )
# r = list(map(lambda t : round(float(t)) **2 ,x ))
# print(*r)




############################################################
# [7-9] 오래된 와인을 찾아라
############################################################
# i = input().split()

# # 함수는
# # 최소 -> 앞뒤 제거버전 비교

# i = input().split()

# a = min(i, key = lambda a : (a[1:-1],a[0],a[-1]))
# print(a)


#######################################
# #####################
# [7-10] 창고 정리
############################################################

# x = eval(input())

# # 코드 작성
# # 정렬-> 튜플[1]은 작은거, 튜플[2]는 큰거 순으로
# print(sorted(x , key= lambda a : (a[1],-a[2])))