############################################################
# [6-1] 함수의 정의 및 호출
############################################################

# def func1() : print('func1')
# 
# def func2() :
#     print('func2')
# 
# def func3() :
#     print('func3-1')
#     print('func3-2')
# 
# func1()
# 
# def func4() :
#     print('func4-1')
#     return
#     print('func4-2')
# 
# func2()
# func3()
# func4()

############################################################
# [6-2] 함수의 리턴
############################################################

# print('start')

# def func1() :
#     print('func1-1')
#     return
#     print('func1-2')
#     return None
#     print('func1-3')

# func1()
# print(func1())

# print('stop')

############################################################
# [6-3] 함수의 Parameter
############################################################

# def func1(a) :
#     print('func1', a)
# 
# def func2(a, b) :
#     c = a + b
#     print('func2', a, b, c)
# 
# func1(10)
# func1('kim')
# 
# func2(30, 40)
# func2('kim', 'lew')
# func2([1,2,3], [4,5,6])
# func2('kim', 10)

############################################################
# [6-4] 함수의 값 Return
############################################################

# def func(a) :
#     print(a)
#     return a + 1 
# 
# func(10)
# x = func(20)
# print(x)
# print(func(30))

############################################################
# [6-5] return 식이 여럿인 함수
############################################################

# def func(a, b) :
#     return a + b, a - b, a *  b, a // b
# 
# print(func(10, 3))

############################################################
# [6-6] 문자열 복제기
############################################################

# def string_repeat(s, n) :

#     # 코드 작성
#     x = s*n

#     return x

# y = string_repeat('kim', 2)
# print(y)
# print(string_repeat('hello', 3))

############################################################
# [6-7] 함수의 변수 사용
############################################################

# cnt = 0
# 
# def func() :
#     cnt += 1
# 
# func()
# func()
# 
# print(cnt)

############################################################
# [6-8] global 키워드
############################################################

# def f2( ):
#     global a
#     global b
#     a = 10
#     b = 20
#     c = 30 + d
#     print(a, b, c)
# 
# a, c, d = 1, 3, 5
# print(a)
# f2()
# print(a, b, c)

############################################################
# [6-9-1] 함수의 parameter에 immutable argument의 전달
############################################################

# def f1(a) :
#     a = 100
#     print(a)
#     
# a = 10
# 
# f1(a)
# print(a)

############################################################
# [6-9-2] 함수의 parameter에 mutable argument의 전달
############################################################

# def f2(x) :
#     x[0] = 100
#     x.append(200)
#     print(x)
# 
# b = [1,2,3,4]
# 
# f2(b)
# print(b)

############################################################
# [6-10] 전역, 지역 namespace 확인
############################################################

# import pprint as pp
# 
# msg = 'happy'
# 
# def func(a, b) :
#     c = a + b
#     pp.pprint(locals())
#     return c
# 
# print(dir(__builtins__))
# pp.pprint(globals())
# print(func(10, 20))

############################################################
# [6-11] Position or Keyword Parameter(pPK)
############################################################

# def func(a, b): 			#pPK, pPK
#     print('%d, %d' %(a, b))
#     
# func(10, 20)            		#aP, aP
# func(a = 10, b = 20)    		#aK, aK
# func(b = 10, a = 20)    		#aK, aK
# func(10, b = 20)        		#aP, aK
# func(a = 10, 20)       		#aK, aP
# func(20, a = 10)       		#aP, aK

############################################################
# [6-12] Default pPK Parameter(pPKd) 1
############################################################

# def func(a, b, c = 300, d = 400): 	    #pPK, pPK, pPKd, pPKd
#     print('%d, %d, %d, %d' %(a, b, c, d))
#     
# func(10, 20)                              #aP, aP, (aKd), (aKd)
# func(10, 20, 30)                          #aP, aP, aP, (aKd)
# func(a = 10, b = 20)                      #aK, aK, (aKd), (aKd)
# func(a = 10, b = 20, c = 30, d = 40)      #aK, aK, aK, aK
# func(a = 10, b = 20, d = 40)              #aK, aK, (aKd), aK
# func(10, 20, d = 40)                      #aP, aP, (aKd), aK

############################################################
# [6-13] Default pPK Parameter(pPKd) 2
############################################################

# def func(a, b = 200, c): 		  #pPK, pPKd, pPK
#     print('%d, %d, %d' %(a, b, c))
# 
# func(10, 20, 30)         		  #aP, aP, aP

############################################################
# [6-14] Keyword Only Parameter(pK, pKd) 1
############################################################

# def func(*, a, b = 200, c): 	    #pK, pKd, pK
#     print('%d, %d, %d' %(a, b, c))
#     
# func(a = 10, b = 20, c = 30) 	    #aK, aK, aK
# func(c = 30, b = 20, a = 10) 	    #aK, aK, aK
# func(a = 10, c = 30)         	    #aK, aK
# func(10, 20, 30)            	    #ap, ap, ap

############################################################
# [6-15] Keyword Only Parameter(pK, pKd) 2
############################################################

# def func(a, b = 200, *, c, d = 400, e): 	 #pPK, pPKd, pK, pKd, pK
#     print('%d, %d, %d, %d, %d' %(a, b, c, d, e))
#     
# func(10, 20, c = 30, d = 40, e = 50)     	#aP, aP, aK, aK, aK
# func(10, e = 50, c = 30)                	#aP, (aKd), aK, (aKd), aK
# func(e = 50, c = 30, a = 10)            	#aK, (aKd), aK, (aKd), aK
